Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.Add Method (AnalysisArea)
 Adds an analysis area to the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Add(
	AnalysisArea AnalysisArea
)
Public Sub Add (
	AnalysisArea As AnalysisArea
)
Parameters
AnalysisArea
Type: Tekla.Structures.Analysis.AnalysisArea
The analysis area to be added.
See Also
Reference
AnalysisPart Class
Add Overload
Tekla.Structures.Analysis Namespace